; 主引导程序
SECTION MBR vstart=0x7c00 ; 该SECTION在内存的起始地址 0x7c00
    mov ax,cs
    mov ds,ax
    mov es,ax
    mov ss,ax
    mov fs,ax
    mov sp,0x7c00

; 清屏
; -----------------------------------------------------------
; INT 0x10   功能号:0x06	   功能描述:上卷窗口
; AH 功能号= 0x06
;------------------------------------------------------
; VGA文本模式中,一行只能容纳80个字符,共25行。
; 下标从0开始,所以0x18=24,0x4f=79
   mov     ax, 0x600
   mov     bx, 0x700
   mov     cx, 0           ; 左上角: (0, 0)
   mov     dx, 0x184f	   ; 右下角: (80,25),

   int     0x10            ; int 0x10

; 0x10 中断会在 ah bh 中处理有关光标的数据
mov ah, 3		; 输入: 3号子功能是获取光标位置,需要存入ah寄存器
mov bh, 0		; bh寄存器存储的是待获取光标的页号
int 0x10		; 输出: ch=光标开始行,cl=光标结束行

; 打印字符串
; -----------------------------------------------------------
; INT 0x10   功能号:0x13	   功能描述:打印字符串
; AH 功能号= 0x13
;------------------------------------------------------
   mov ax, message
   mov bp, ax

   mov cx, 5		; cx 为串长度,不包括结束符0的字符个数
   mov ax, 0x1301	; 子功能号13是显示字符及属性,要存入ah寄存器,
   mov bx, 0x2		; bh存储要显示的页号,此处是第0页,bl中是字符属性, 属性黑底绿字(bl = 02h)
   int 0x10		    ; 执行BIOS 0x10 号中断

   jmp $ ;程序悬停后,内存中数据不被清理,不断在显示器上刷新
   message db "Hello MBR"
   times 510-($-$$) db 0
   db 0x55,0xaa

